const Models = require("../../mongo/models");

const newsObject = [
    {
        code: "CODE-1",
        newsContext: [
            {
                title: "راهنمای ضدعفونی سازی دستگاه ونتیلاتور",
                shortDescription:
                    "شرکت احیا درمان پیشرفته باتوجه به شرایط ویژه بوجود آمده در کشور اقدام به ایجاد یک دستورلعمل استاندارد جهت حضور در مراکز درمانی در فیلد دستگاه های تنفسی نموده تا در چنین شرایط علاوه بر رعایت اصول ایمنی بتواند به رسالت خود در خدمات رسانی به موقع و با کیفیت به مراکز درمان عمل کند.",
                description:
                    " این دستورالعمل به شرح ذیل است:\n" +
                    "\n" +
                    "1- هدف: ضدعفونی سازی دستگاه به منظور اطمینان از پاکیزگی آن و پیشگیری از انتقال بیماری های مسری پس از استفاده.\n" +
                    "\n" +
                    "2- دامنه کاربرد: دستگاه ونتیلاتور و تمامی قطعات مرتبط با مسیر تنفسی بیمار\n" +
                    "\n" +
                    "3- مسئولیت: مسئولیت اجرای تمامی بندهای این راهنما بر عهده مراکز درمانی است.\n" +
                    "\n" +
                    "4-تعاریف: وسیله نیمه بحرانی: وسیله ای است که با غشاء مخاطی یا پوست ناسالم تماس داشته و به درون بافت نرم نفوذ نمی کند. طبق این تعریف، ونتیلاتور در طبقه وسایل نیمه بحرانی قرار میگیرد.\n" +
                    "\n" +
                    "5- مقدمه: آلودگی زدایی به کلیه فرآیند های کلی ایمن کردن یک وسیله آلوده شامل تمام پروسه های مرتبط با پاکسازی، ضدعفونی و استریلیزه اطلاق میشود که طی آن از مرحله نخست تا مرحله آخر صورت میگیرد. در واقع Decontamination پروسه ای می باشدکه توسط اجرای صحیح آن یک وسیله آلوده، به یک وسیله ایمن برای استفاده بیمار تبدیل میشود.\n" +
                    "\n" +
                    "6- شرح روش:\n" +
                    "\n" +
                    "6-1. مراحل پروسه آلودگی زدایی:\n" +
                    "\n" +
                    "پیش غوطه وری\n" +
                    "پاکسازی\n" +
                    "ضد عفونی\n" +
                    "نکته: حداکثر رفع آلودگی با استفاده از ضد عفونی کننده های High level حاصل میشود.\n" +
                    "\n" +
                    "6-2. ضد عفونی کننده های High level :\n" +
                    "\n" +
                    "گلوتار الدئید2% (نام تجاری: سایدکس)\n" +
                    "ارتو فتالالدئید 55/0 %\n" +
                    "پراکسید هیدروژن 5/7 % - 6 ساعت ( نام تجاری : آب اکسیژنه)\n" +
                    "اسید پراستیک 1% به بالا 3تا8 ساعت (نام تجاری : پرسیدین)\n" +
                    "هیپو کلریت سدیم ppm 1000 (نام تجاری : وایتکس)\n" +
                    "اتیل الکل 70%\n" +
                    "ایزوپروپیل الکل\n" +
                    "یادآوری: جهت اثربخشی، تمامی مواد فوق بایستی به مدت 12 الی 30 دقیقه در تماس مستقیم با قطعه باشد (دما 20 درجه سانتیگراد).\n" +
                    "\n" +
                    "6-3. سطوح نیازمند ضدعفونی سازی:\n" +
                    "\n" +
                    "6-3-1. سطوح بیرونی ونتیلاتور:\n" +
                    "\n" +
                    "کلیه سطوح (سطوح خارجی ونتیلاتور، بازوی نگه دارنده ست های تنفسی، ترالی و چرخها) توسط ضد عفونی کننده های High level قابل ضدعفونی کردن می باشند.\n" +
                    "\n" +
                    "6-3-2. نمایشگر Touch screen\n" +
                    "\n" +
                    "توسط یک پارچه نرم آغشته به محلول های ضد عفونی (ایزوپروپیل) به نرمی صفحه نمایشگر را تمیز نمایید و از اسپری کردن مستقیم محلول ضد عفونی بر روی دستگاه خودداری کنید (استفاده از هرگونه مواد شستشو دهنده اسیدی ممنوع میباشد). همچنین تمیز کردن نمایشگر بایستی با دقت زیاد صورت گیرد تا از ایجاد خراش و آسیب جلوگیری شود.\n" +
                    "\n" +
                    "6-3-3. رطوبت ساز (Humidifier)\n" +
                    "\n" +
                    "در صورت استفاده از هیومیدی فایر بر روی دستگاه در مرحله تست گزینه Active انتخاب شده، چمبر هیومیدی فایر باید برای هر بیمار ضد عفونی و استریل شود. در صورت استفاده از اتوکلاو، تنظیمات بر روی دمای 136 °C به مدت 4 دقیقه یا 120°C به مدت 15 دقیقه باشد، همچنین از اتیلن اکساید در دمای 55°C نیز میتوان استفاده نمود.\n" +
                    "\n" +
                    "تذکر: از فیلتر HME و هیومیدی فایر بطور همزمان استفاده نشود.\n" +
                    "\n" +
                    "6-3-4. لوله های مخصوص بیمار و نبولایزر:\n" +
                    "\n" +
                    "در صورت استفاده از لوله های سیلیکونی قابل استفاده مجدد، با مراجعه به دستورالعمل سازنده نسبت به ضدعفونی یا استریل اقدام نمایید.\n" +
                    "از لوله های یکبار مصرف به هیچ عنوان مجددا استفاده نشود.\n" +
                    "6-3-5.فلوسنسور بازدمی Expiratory Valve\n" +
                    "\n" +
                    "دریچه بازدمی قابل ضدعفونی با مواد ضد عفونی کننده High Level بوده و در هنگام ضدعفونی سازی تمام مراحل پیش غوطه وری، پاکسازی و ضد عفونی باید برای این قطعه و تمام متعلقات آن شامل شیلنگهای L، درپوش و دیافراگم داخلی انجام گیرد. رعایت زمان حداقل 20 دقیقه برای ضدعفونی کردن الزامی است.\n" +
                    "\n" +
                    "یادآوری: استفاده از فیلترهای آنتی وایرال در مدار تنفسی (در مسیر بازدم) توصیه میشود، مدت زمان استفاده از فیلترها بر اساس پروتکل اعلام شده از طرف سازنده فیلتر می باشد.",
                locale: "fa-IR",
            },
        ],
        defaultImage: "default.png",
        image: "image1",
        smallImage: "smallImage1",
        createdBy: "user1",
        type: "article",
    },
    {
        code: "CODE-2",
        newsContext: [
            {
                title: "دستورالعمل حضور در مراکز درمانی - دستگاه های تنفسی",
                shortDescription:
                    "شرکت احیا درمان پیشرفته باتوجه به شرایط ویژه بوجود آمده در کشور اقدام به ایجاد یک دستورلعمل استاندارد جهت حضور در مراکز درمانی در فیلد دستگاه های تنفسی نموده تا در چنین شرایط علاوه بر رعایت اصول ایمنی بتواند به رسالت خود در خدمات رسانی به موقع و با کیفیت به مراکز درمان عمل کند.",
                description:
                    " این دستورالعمل به شرح ذیل است:\n" +
                    "\n" +
                    "1- هدف: حفظ سلامت، ایمنی و بهداشت پرسنل در شرایط اپیدمی بیماری های مسری\n" +
                    "\n" +
                    "2- دامنه کاربرد: کلیه خدمات پس از فروش شامل نصب و راه اندازی، سرویس های دوره ای، تعمیرات\n" +
                    "\n" +
                    "3- مسئولیت: مسئولیت اجرای این دستورالعمل برعهده کلیه کارشناسان خدمات پس از فروش بوده و نظارت بر حسن اجرای آن بر عهده مدیر خدمات پس از فروش می باشد.\n" +
                    "\n" +
                    "4- مقدمه: این واقعیت که ویروس کرونا از جمله ویروسهایی به شمار می رود که مسری بودن آن بیش از احتمال به مرگ، نگران کننده است، امری اجتناب ناپذیر می باشد .بنابراین ویروس مذکور در دسته ویروس های با شیوع بالا قرار میگردد، باعلم به این موضع ضمنِ حفظ آرامش به انجام فعالیت های محوله خود خواهیم پرداخت. و همانطور که مستحضرید، بخش های مراقبت ویژه یکی از پر ترددترین بخش های بیمارستانی خواهد بود، لذا به جهت حفظ ایمنی خود پیروی از نکات ذیل را در دستور کار قرار دهید )رعایت یک به یکِ آیتم ها با حساسیتِ خیلی بالا لازم و ضروری هستند(\n" +
                    "\n" +
                    "5- شرح روش: طبق مصوبه اداره محترم کل تجهیزات پزشکی، مراکز درمانی موظف به ارائه تجهیزات ایزوله به کارشناسان فنی می باشند لذا با توجه به محدودیت شرکت در تهیه تجیهزات در بازار فعلی، در درجه اول به دریافت وسایل مورد نیاز از همان مرکز اهتمام ورزید. جهت این امر قبل از اعزام به ماموریت ضمن ارسال نامه با مسئولین مرتبط هماهنگی های مکتوب و تلفنی لازم صورت پذیرد. در صورتی که بیمارستان به دلیل شرایط کنونی قادر به تامین تجهیزات ایزوله مورد درخواستی به ازای هر نفر در هر روز نباشد، پرسنل بایستی قبل از انجام ماموریت نسبت به تامین اقلام ضروری ذیل از انبار شرکت اقدام نمایند (با پیش بینی تعداد روزهای سرویس دهی به مرکز/مراکز مورد نظر):\n" +
                    "\n" +
                    "لباس ضد آب ایزوله، دستکش، عینک، ماسک N95، چسب ایزوله، روکش کفش\n" +
                    "\n" +
                    "همچنین، قبل از اعزام به ماموریت، ابتدا بایستی موارد زیر تعیین گردد:\n" +
                    "\n" +
                    "مشخص شدن تیم اعزام\n" +
                    "برآورد قطعات مورد نیاز\n" +
                    "زمان تقریبی ماموریت\n" +
                    "محل اسکان\n" +
                    "وسیله ایاب ذهاب\n" +
                    "رعایت موارد ذیل توصیه میگردد:\n" +
                    "\n" +
                    "در هر وسیله ی نقلیه ای که برای انجام ماموریت استفاده میشود، همواره فرضِ آلودگی سطوح را همواره در نظر داشته باشید و کمترین تماس با آنها را به خود گوشزد کنید و عادتِ دست نزدن ناخودآگاه به دهان و بینی و صورت را تمرین کنید و با اسپری پایه الکل دستان خود را ضدعفونی نموده و دراولین فرصت پس از رسیدن به مقصد دستان خود را با آب و صابون بشویید.\n" +
                    "به دلیل احتمال پارگی، تعداد کافی لوازم مصرفی از قبیل دستکش و کاور کفش به همراه داشته باشید.\n" +
                    "تجهیزات ضدعفونی از قبیل اسپری حداقل 300 سی سی الکل، جهت ضد عفونی کردن البسه وتجهیزات همراه داشته باشید. دقت نمایید استفاده نامناسب الکل موجب خرابی سطوح و لوازم الکتریکی نیز میگردد.\n" +
                    "جهت نوشتن گزارش سرویس از خودکار شخصی استفاده نمایید و لوازم اداری در بیمارستان همچون چسب، منگنه و .... را اکیدا استفاده نفرمایید.\n" +
                    "در کلیه مراحل کاری از بدو ورود به بیمارستان تا پایان انجام کار بصورت مداوم از ماسک، دستکش و لباسِ مخصوص استفاده نمایید.\n" +
                    "از به همراه داشتن تجهیزات اضافی از قبیل کوله و لباسهایی چون کاپشن و پالتو که درصد آلوده شدن را بالا میبرد به شدت اجتناب فرمایید.\n" +
                    "در به انجام رساندنِ ماموریت در کمترین زمان ممکن (نظر به آلوده بودن محیط بیمارستان) اهتمام ورزید.\n" +
                    "با فرضِ آلوده بودن کلیه ی افراد حاضر در بیمارستان، از مراودت و گفتگوهای غیر فنی به شدت پرهیز فرمایید و در صورت ضروری بودن گفتگو، حتما فاصله یک و نیم تا دو متری با ایشان را به طور محترمانه ای در حین صحبت رعایت فرمایید.\n" +
                    "تا حد امکان از سرویس های بهداشتی بیمارستان، فرودگاه و یا ترمینال استفاده نفرمایید و در صورت لزوم در بیمارستان حتما از سرویس های بهداشتی مخصوص کارکنان مرکز و در سایر محیط های عمومی، اصول بهداشتی را رعایت فرمایید.\n" +
                    "قبل از شروع به کار تا حد امکان محیط، دستگاه را بدون کمترین تماس و با دستکش ضد عفونی نمایید و در صورت تماس، بعد از اتمام کار دستکشِ دیگری استفاده کنید.\n" +
                    "با حفظ احترام از حضور افراد دیگر در اتاق و در حین کار جلوگیری بعمل آورید.\n" +
                    "در صورت نیاز به اقامت در هتل در ماموریت های چند نفره در صورت امکان اتاق ها به صورت جداگانه رزرو گردد.\n" +
                    "پس از اتمام کار با رعایت نکات بهداشتی دستکش ها را در آورده و بلافاصله و قبل از تماس با صورت دست ها را با آب صابون شسته و ضد عفونی کنید.\n" +
                    "ترجیحا گاز غیر استریل و دستمال کاغذی همراه داشته باشید و جهت کاهش آلودگی از دستکش، دستمال و یا گاز برای باز کردن درب ها و کشوها استفاده نمایید.\n" +
                    "جهت کمترین وابستگی به محیط خارج در حین انجام ماموریت در شهرستانهایی که نیاز به گرم کردن غذا وجود دارد، مواد غذایی آماده همچون کنسرو و آب معدنی و لوازم جانبی همچون گاز پیک نیکی مسافرتی، قابلمه کوچک و ... به همراه داشته باشید\n" +
                    "جهت مراکزی که ایاب ذهاب زمینی از تهران می باشد قبل از ماموریت، وسیله ایاب و ذهاب در اختیار مشخص و رزرو گردد.\n" +
                    "سطح نصب دستگاه و اتاق های مرتبط را حتما پیش از استفاده ضدعفونی نمایید.\n" +
                    "نکته: با توجه به شرایط روحیِ حاکم در بیمارستانها با حفظ آرامش کلیه درخواست های خود را از پرسنل بیمارستان مطالبه فرمایید و در صورت بروز هرگونه مشکلی سعی بر آرام کردن فضا نموده و با مشورت قبلی با ارجاع آن موضوع به مدیریت موضوع را محترمانه پیگیری نمایید.",
                locale: "fa-IR",
            },
        ],
        image: "image2",
        defaultImage: "default.png",
        smallImage: "smallImage2",
        createdBy: "user2",
        type: "news",
    },
    {
        code: "CODE-3",
        newsContext: [
            {
                title: "کارگاه آموزشی تهویه مکانیکی در استان تبریز در 25 و 26 تیر ماه 98",
                shortDescription:
                    "کارگاه آموزشی تهویه مکانیکی در استان تبریز در 25 و 26 تیر ماه 98",
                description:
                    "کارگاه آموزشی تهویه مکانیکی با همکاری شرکت احیا درمان پیشرفته و دانشگاه علوم پزشکی تبریز در تاریخ 25 و 26 تیر ماه 98 به ترتیب برای گروه پرستاران و گروه پزشکان در سالن کنفرانس بیمارستان امام رضا(ع) تبریز و در",
                locale: "fa-IR",
            },
        ],
        image: "image3",
        defaultImage: "default.png",
        smallImage: "smallImage3",
        createdBy: "user3",
        type: "article",
    },
    {
        code: "CODE-4",
        newsContext: [
            {
                title: "کارگاه آموزشی تهویه مکانیکی و کار با ونتیلاتور در 20 دی ماه 98 در حاشیه کنگره مراقبت های ویژه در مرکز همایش های رازی شهر تهران",
                shortDescription:
                    "کارگاه آموزشی تهویه مکانیکی و کار با ونتیلاتور در حاشیه هفتمین کنگره بین المللی مراقبت های ویژه در دی ماه 98،",
                description:
                    "کارگاه آموزشی تهویه مکانیکی و کار با ونتیلاتور در حاشیه هفتمین کنگره بین المللی مراقبت های ویژه در دی ماه 98، با همکاری شرکت احیا درمان پیشرفته و انجمن مراقبتهای ویژه ایران در مرکز همایش های رازی شهر تهران برگزار",
                locale: "fa-IR",
            },
        ],
        image: "image4",
        defaultImage: "default.png",

        smallImage: "smallImage4",
        createdBy: "user4",
        type: "news",
    },
    {
        code: "CODE-5",
        newsContext: [
            {
                title: "نمایشگاه مدیکا 2019",
                shortDescription:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد.",
                description:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد. در سال 2019 نیز این نمایشگاه در تاریخ های 18 الی 21 نوامبر (27 الی",
                locale: "fa-IR",
            },
        ],
        image: "image5",
        defaultImage: "default.png",
        smallImage: "smallImage5",
        createdBy: "user5",
        type: "article",
    },
    {
        code: "CODE-6",
        newsContext: [
            {
                title: "نمایشگاه مدیکا 2019",
                shortDescription:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد.",
                description:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد. در سال 2019 نیز این نمایشگاه در تاریخ های 18 الی 21 نوامبر (27 الی",
                locale: "fa-IR",
            },
        ],
        image: "image5",
        defaultImage: "default.png",
        smallImage: "smallImage5",
        createdBy: "user5",
        type: "article",
    },
    {
        code: "CODE-7",
        newsContext: [
            {
                title: "نمایشگاه مدیکا 2019",
                shortDescription:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد.",
                description:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد. در سال 2019 نیز این نمایشگاه در تاریخ های 18 الی 21 نوامبر (27 الی",
                locale: "fa-IR",
            },
        ],
        image: "image5",
        defaultImage: "default.png",
        smallImage: "smallImage5",
        createdBy: "user5",
        type: "article",
    },
    {
        code: "CODE-8",
        newsContext: [
            {
                title: "نمایشگاه مدیکا 2019",
                shortDescription:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد.",
                description:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد. در سال 2019 نیز این نمایشگاه در تاریخ های 18 الی 21 نوامبر (27 الی",
                locale: "fa-IR",
            },
        ],
        image: "image5",
        defaultImage: "default.png",
        smallImage: "smallImage5",
        createdBy: "user5",
        type: "article",
    },
    {
        code: "CODE-9",
        newsContext: [
            {
                title: "نمایشگاه مدیکا 2019",
                shortDescription:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد.",
                description:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد. در سال 2019 نیز این نمایشگاه در تاریخ های 18 الی 21 نوامبر (27 الی",
                locale: "fa-IR",
            },
        ],
        image: "image5",
        defaultImage: "default.png",
        smallImage: "smallImage5",
        createdBy: "user5",
        type: "article",
    },
    {
        code: "CODE-10",
        newsContext: [
            {
                title: "کارگاه اصول نگهداشت ماشین های بیهوشی برای مهندسین پزشکی دانشگاه علوم پزشکی گیلان",
                shortDescription:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد.",
                description:
                    "نمایشگاه مدیکا آلمان معتبرترین و بزرگترین نمایشگاه جهان در زمینه محصولات و تجهیزات پزشکی می باشد که هر ساله در شهر دوسلدورف برگزار می گردد. در سال 2019 نیز این نمایشگاه در تاریخ های 18 الی 21 نوامبر (27 الی",
                locale: "fa-IR",
            },
        ],
        image: "image5",
        defaultImage: "default.png",
        smallImage: "smallImage5",
        createdBy: "user5",
        type: "article",
    },

];

const newsPromise = new Promise(async (resolve, reject) => {
    try {
        await Models.News.deleteMany({});
        await Models.News.create(newsObject);
        console.info("[+] News updated successfully.");

        resolve();
    } catch (e) {
        console.error("[!] Error in creating and updating news.", e);
        reject();
    }
});

module.exports = newsPromise;
